cases/05_navier_stokes_equation/08_lid_driven_cavity_projection_Re1000_hybrid80/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /    O  peration     |
    \  /    A nd           |
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

// 初始条件：
//
//     U(x,y,0) = (0,0,0)
//
// 顶盖边界：
//
//     U(x,1,t) = (1,0,0)
//
// 其它三面：
//
//     U = (0,0,0)
dimensions [0 1 -1 0 0 0 0];
internalField uniform (0 0 0);
boundaryField
{
    leftWall
    {
        type noSlip;
    }
    rightWall
    {
        type noSlip;
    }
    bottomWall
    {
        type noSlip;
    }
    movingTop
    {
        type fixedValue;
        value uniform (1 0 0);
    }
    front
    {
        type empty;
    }
    back
    {
        type empty;
    }
}
