cases/05_navier_stokes_equation/08_lid_driven_cavity_projection_Re1000_hybrid80/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /    O  peration     |
    \  /    A nd           |
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}

// 时间离散：
//
//     ∂U/∂t ≈ (Uⁿ⁺¹ - Uⁿ) / Δt
ddtSchemes
{
    default Euler;
}

// 单元中心梯度和非正交面法向梯度。
gradSchemes
{
    default Gauss linear;
}

divSchemes
{
    default none;

    //     ∇·(U U) = 1/V_c Σ_f Φ_f U_f
    //     Φ_f = U_f · S_f
    div(phi,U) Gauss linearUpwind grad(U);
    // 预测速度 UStar 使用同一个对流离散格式。
    // 这是源码 fvm::div(phi, UStar) 的字段名匹配入口。
    div(phi,UStar) Gauss linearUpwind grad(U);
}

laplacianSchemes
{
    default none;

    //     ∇·(ν∇U) = 1/V_c Σ_f (ν∇U)_f · S_cf
    laplacian(nu,U) Gauss linear corrected;
    // 预测速度方程实际调用 fvm::laplacian(nu, UStar)。
    laplacian(nu,UStar) Gauss linear corrected;

    // 压力投影方程：
    //
    //     ∇·(Δt∇p) = ∇·Φ*
    laplacian(dtCoeff,p) Gauss linear corrected;
}

interpolationSchemes
{
    default linear;
}

snGradSchemes
{
    default corrected;
}
